src/cf/Documents/уатПоступлениеАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПоступлениеАгрегатов</Name>
			<BasedOn>
				<xr:Item>Document.уатИнвентаризацияАгрегатов</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОстаткиАгрегатов</xr:Item>
				<xr:Item>AccumulationRegister.уатИзносАгрегатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатИнвентаризацияАгрегатов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Износ</Name>
							<Comment>Износ в валюте шины</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аккумуляторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Износ</Name>
							<Comment>Износ в валюте шины</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеАгрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Износ</Name>
							<Comment>Износ в валюте шины</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВариантыНачисленияИзносаАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыНачисленияИзносаАгрегатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Период</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачислять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийВыдачаРасходныхМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийВыдачаРасходныхМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВПроизводство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатВыдачаРасходныхМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатВыдачаРасходныхМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>AccumulationRegister.уатНоменклатураТС</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатСпецодеждаИИнструментыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийВыдачаРасходныхМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад, с которого берутся агрегаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Механик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>Учитывать НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Служебный реквизит отражающий сумму в валюте регл учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатПоступлениеАгрегатов/Forms/МастерПоступленияАгрегатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ДокументОснование") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДокументОснование = Параметры.ДокументОснование;
	Для Каждого ТекСтрока Из ДокументОснование.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.Валюта = ДокументОснование.ВалютаДокумента;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заглушка = Истина;
	//Если ВладелецФормы = Неопределено Тогда
	//	ПоказатьПредупреждение(Неопределено, НСтр("en='Immediate opening for this object is prohibited!';ru='Непосредственное открытие для данного объекта запрещено!'"), 10);
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	Если ЗаполнитьСкладИзПоступленияМатериалов Тогда
		СкладАгрегатов = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ДокументОснование, "Склад");
		Элементы.СкладАгрегатов.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		Для Каждого ТекЭлем Из ВыбранноеЗначение Цикл
			НоваяСтрока = Агрегаты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлем.Значение);
		КонецЦикла;
		ОбновитьКоличествоАгрегатов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПакетныйВводАгрегатов(Команда)
	
	ТекСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрокаТовары = Неопределено Тогда
		ТекстСообщения = "Для заполнения данных по агрегатам спозиционируйтесь на строке номенклатуры.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
	ПараметрыФормы.Вставить("Количество", ТекСтрокаТовары.Количество);
	ПараметрыФормы.Вставить("Цена", ТекСтрокаТовары.Цена);
	ПараметрыФормы.Вставить("Валюта", ТекСтрокаТовары.Валюта);
	ТипАгрегатаПоиск = ПолучитьТипАгрегатаПоНаименованиюТовара(Строка(ТекСтрокаТовары.Номенклатура));
	Если ЗначениеЗаполнено(ТипАгрегатаПоиск) Тогда
		ПараметрыФормы.Вставить("ТипАгрегата", ТипАгрегатаПоиск);
	КонецЕсли;
	ПараметрыФормы.Вставить("НеСоздаватьАгрегаты", Истина);
	
	ОткрытьФорму("Обработка.уатПакетныйВводАгрегатов.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИПеренестиВДокумент(Команда)

	Если НЕ ЗначениеЗаполнено(Механик) ИЛИ НЕ ЗначениеЗаполнено(Кладовщик) Тогда
		ТекстСообщения = "Не указаны значения реквизитов документа ""Выдача расходных материалов"".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(СкладАгрегатов) Тогда
		ТекстСообщения = "Не указаны значения реквизитов документа ""Поступление агрегатов"".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// проверка на дубли сгенерированных СН
	ТекстСообщения = "";
	ДубльСН = Неопределено;
	Если ЕстьДублиСерийныхНомеров(ДубльСН) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон(
			НСтр("en='Several units with the same serial number will be created (%1)';ru='Будет создано несколько агрегатов с одинаковым серийным номером (%1)'"), ДубльСН);
	КонецЕсли;
	// проверка на наличие в базе агрегата с таким же СН, как один из сгенерированных
	СписокАгрегатов = ПолучитьСписокАгрегатовПоСерийнымНомерам();
	Если СписокАгрегатов.Количество() Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС
			+ НСтр("en='For specified serial numbers in system are already have car parts';ru='Для указанных серийных номеров в системе уже имеются агрегаты'");
		Для Каждого ТекЭлем Из СписокАгрегатов Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + " " + ТекЭлем.Наименование + " (" + НСтр("en='serial number';ru='с/н'") + ": " + ТекЭлем.СерийныйНомер + ")";
		КонецЦикла;
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		Оповещ = Новый ОписаниеОповещения("СоздатьИПеренестиВДокументОтвет", ЭтотОбъект);
		ТекстСообщения = Сред(ТекстСообщения, 2) + Символы.ПС + НСтр("en='Continue?';ru='Продолжить?'");
		ПоказатьВопрос(Оповещ, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	СоздатьИПеренестиВДокументПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИПеренестиВДокументОтвет(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СоздатьИПеренестиВДокументПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИПеренестиВДокументПродолжение()
	
	мсвСозданныеДокументы = Новый Массив;
	флОтказ = Ложь;
	СоздатьИПеренестиВДокументСервер(мсвСозданныеДокументы, флОтказ);
	
	Если НЕ флОтказ Тогда
		Для Каждого ТекДокумент Из мсвСозданныеДокументы Цикл
			ПоказатьЗначение(Неопределено, ТекДокумент);
		КонецЦикла;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИПеренестиВДокументСервер(мсвСозданныеДокументы, флОтказ)
	
	НачатьТранзакцию();
	
	мсвСозданныеДокументы = Новый Массив;
	флОтказ = Ложь;
		
	// 1. Агрегаты с износом
	СоздатьАгрегатыСписаниеИПоступление(Истина, мсвСозданныеДокументы, флОтказ);
	
	// 2. Агрегаты без износа
	Если НЕ флОтказ Тогда
		СоздатьАгрегатыСписаниеИПоступление(Ложь, мсвСозданныеДокументы, флОтказ);
	КонецЕсли;
	
	Если флОтказ тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрокаТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.Агрегаты.ОтборСтрок = Новый ФиксированнаяСтруктура(
		Новый Структура("Номенклатура", ТекСтрокаТовары.Номенклатура));
	
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.Агрегаты.ТекущиеДанные;
	ТекСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	
	Если ТекСтрокаТовары <> Неопределено Тогда
		ТекСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		ТекСтрока.ПервоначальнаяСтоимость = ТекСтрокаТовары.Цена;
		ТекСтрока.Валюта = ТекСтрокаТовары.Валюта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		ТипАгрегатаПоиск = ПолучитьТипАгрегатаПоНаименованиюТовара(Строка(ТекСтрока.Номенклатура));
		Если ЗначениеЗаполнено(ТипАгрегатаПоиск) Тогда
			ТекСтрока.ТипАгрегата = ТипАгрегатаПоиск;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьКоличествоАгрегатов();
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыПослеУдаления(Элемент)
	ОбновитьКоличествоАгрегатов();
КонецПроцедуры

&НаКлиенте
Процедура АгрегатыМодельПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Агрегаты.ТекущиеДанные;
	ТекСтрока.ПараметрВыработки = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(
		ТекСтрока.Модель, "ПараметрВыработки");
	Если ТекСтрока.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда	
		ТекСтрока.СрокСлужбыШины = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(
			ТекСтрока.Модель, "СрокСлужбы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкладИзПоступленияМатериаловПриИзменении(Элемент)
	Если ЗаполнитьСкладИзПоступленияМатериалов Тогда
		СкладАгрегатов = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ДокументОснование, "Склад");
		Элементы.СкладАгрегатов.ТолькоПросмотр = Истина;
	Иначе
		Элементы.СкладАгрегатов.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьАгрегатыСписаниеИПоступление(флАгрегатыСНачислениемИзноса, мсвСозданныеДокументы, флОтказ = Ложь)
	
	// Создание агрегатов
	мсвАгрегаты = Новый Массив;
	тблТовары = Новый ТаблицаЗначений;
	тблТовары.Колонки.Добавить("Номенклатура");
	тблТовары.Колонки.Добавить("ЕдиницаИзмерения");
	тблТовары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Для Каждого ТекСтрока Из Агрегаты Цикл
		Если (ТекСтрока.Модель.ВариантНачисленияИзноса = Перечисления.уатВариантыНачисленияИзносаАгрегатов.НеНачислять
			ИЛИ ТекСтрока.Модель.ВариантНачисленияИзноса.Пустая()) = флАгрегатыСНачислениемИзноса Тогда
			Продолжить;
		КонецЕсли;
		
		мсвСтрокиТоварыПоиск = Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрока.Номенклатура));
		Если мсвСтрокиТоварыПоиск.Количество() > 0 Тогда
			ТекЕИ = мсвСтрокиТоварыПоиск[0].ЕдиницаИзмерения;
		КонецЕсли;
		НоваяСтрокаТовары = тблТовары.Добавить();
		НоваяСтрокаТовары.Номенклатура = ТекСтрока.Номенклатура;
		НоваяСтрокаТовары.ЕдиницаИзмерения = ТекЕИ;
		НоваяСтрокаТовары.Количество = 1;
		
		НовыйАгрегат = Справочники.уатСерииНоменклатуры.СоздатьЭлемент();
		НовыйАгрегат.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(НовыйАгрегат, ТекСтрока);
		
		Попытка 
			НовыйАгрегат.Записать();
			мсвАгрегаты.Добавить(НовыйАгрегат.Ссылка);
		Исключение
			ТекстСообщения = НСтр("en='Failed to record car part:';ru='Не удалось записать агрегат:'") + " " + НовыйАгрегат.Наименование;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			флОтказ = Истина;
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	тблТовары.Свернуть("Номенклатура, ЕдиницаИзмерения", "Количество");
	
	Если флОтказ ИЛИ мсвАгрегаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	// Создание документа уатВыдачаРасходныхМатериалов
	ДокСписание = Документы.уатВыдачаРасходныхМатериалов.СоздатьДокумент();
	ДокСписание.Заполнить(Неопределено);
	ДокСписание.ДокументОснование = ДокументОснование;
	Если флАгрегатыСНачислениемИзноса Тогда
		ДокСписание.ВидОперации = Перечисления.уатВидыОперацийВыдачаРасходныхМатериалов.СписаниеВПроизводство;
	Иначе
		ДокСписание.ВидОперации = Перечисления.уатВидыОперацийВыдачаРасходныхМатериалов.СписаниеНаПрочиеРасходы;
	КонецЕсли;
	ДокСписание.Дата = ТекущаяДатаСеанса();
	ДокСписание.УстановитьНовыйНомер();
	ДокСписание.Организация = ДокументОснование.Организация;
	ДокСписание.Подразделение = ?(ЗначениеЗаполнено(ДокументОснование.Подразделение), ДокументОснование.Подразделение,
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновноеПодразделениеОрганизации"));
	ДокСписание.Склад = ДокументОснование.Склад;
	ДокСписание.Ответственный = ДокументОснование.Ответственный;
	ДокСписание.Кладовщик = Кладовщик;
	ДокСписание.Механик = Механик;
	
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") Тогда
		Если уатОбщегоНазначения.уатНайтиПланЗатрат(ДокСписание.ПланЗатрат, ДокСписание.Организация, Неопределено) Тогда
			//ТекстНСТР = НСтр("en='Cost plan is not found!';ru='Не найден план затрат!'");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецЕсли;	
	КонецЕсли;
	
	Для Каждого ТекСтрока Из тблТовары Цикл
		Если ТекСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокСписание.Материалы.Добавить();
		НоваяСтрока.Номенклатура     = ТекСтрока.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
		НоваяСтрока.Количество       = ТекСтрока.Количество;
	КонецЦикла;
	Попытка 
		ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
		мсвСозданныеДокументы.Добавить(ДокСписание.Ссылка);
	Исключение
		ТекстСообщения = НСтр("en='Failed to record car part:';ru='Не удалось провести документ ""Выдача расходных материалов"":'") + " " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		флОтказ = Истина;
	КонецПопытки;
	
	Если флОтказ Тогда
		Возврат;
	КонецЕсли;

	// Создание документа уатПоступлениеАгрегатов
	ДокПоступлениеАгрегатов = Документы.уатПоступлениеАгрегатов.СоздатьДокумент();
	ДокПоступлениеАгрегатов.Заполнить(ДокументОснование);
	ДокПоступлениеАгрегатов.Дата = ТекущаяДатаСеанса();
	ДокПоступлениеАгрегатов.УстановитьНовыйНомер();
	ДокПоступлениеАгрегатов.Организация = ДокументОснование.Организация;
	ДокПоступлениеАгрегатов.Подразделение = ?(ЗначениеЗаполнено(ДокументОснование.Подразделение), ДокументОснование.Подразделение,
		уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновноеПодразделениеОрганизации"));
	ДокПоступлениеАгрегатов.Склад = СкладАгрегатов;	
	ДокПоступлениеАгрегатов.Контрагент = ДокументОснование.Контрагент;
	ДокПоступлениеАгрегатов.ДоговорКонтрагента = ДокументОснование.ДоговорКонтрагента;
	ДокПоступлениеАгрегатов.ВалютаДокумента = ДокументОснование.ВалютаДокумента;
	
	Для Каждого ТекАгрегат Из мсвАгрегаты Цикл
		ТекТипАгрегата = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекАгрегат, "ТипАгрегата");
		Если ТекТипАгрегата	= ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
			НоваяСтрока = ДокПоступлениеАгрегатов.Шины.Добавить();
		ИначеЕсли ТекТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Аккумулятор") Тогда
			НоваяСтрока = ДокПоступлениеАгрегатов.Аккумуляторы.Добавить();
		Иначе
			НоваяСтрока = ДокПоступлениеАгрегатов.ПрочиеАгрегаты.Добавить();
		КонецЕсли;
		НоваяСтрока.СерияНоменклатуры = ТекАгрегат;
		НоваяСтрока.Цена = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекАгрегат, "ПервоначальнаяСтоимость");
	КонецЦикла;
	
	ДокПоступлениеАгрегатов.СуммаДокумента = ДокПоступлениеАгрегатов.Шины.Итог("Цена")
		+ ДокПоступлениеАгрегатов.Аккумуляторы.Итог("Цена") + ДокПоступлениеАгрегатов.ПрочиеАгрегаты.Итог("Цена");
	
	Попытка 
		ДокПоступлениеАгрегатов.Записать(РежимЗаписиДокумента.Проведение);
		мсвСозданныеДокументы.Добавить(ДокПоступлениеАгрегатов.Ссылка);
	Исключение
		ТекстСообщения = НСтр("en='Failed to record car part:';ru='Не удалось провести документ ""Поступление агрегатов"":'") + " " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		флОтказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоАгрегатов()
	Для Каждого ТекСтрока Из Товары Цикл
		ТекСтрока.КоличествоАгрегатов = Агрегаты.НайтиСтроки(
			Новый Структура("Номенклатура", ТекСтрока.Номенклатура)).Количество();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТипАгрегатаПоНаименованиюТовара(НаименованиеТовара)
	
	Если СтрНайти(НРег(НаименованиеТовара), "шина") <> 0 ИЛИ СтрНайти(НРег(НаименованиеТовара), "шины") <> 0 Тогда
		Возврат ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина");
	ИначеЕсли СтрНайти(НРег(НаименованиеТовара), "аккумулятор") <> 0 Тогда
		Возврат ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Аккумулятор");
	ИначеЕсли СтрНайти(НРег(НаименованиеТовара), "аптечка") <> 0 ИЛИ СтрНайти(НРег(НаименованиеТовара), "аптечки") <> 0 Тогда
		Возврат ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Аптечка");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЕстьДублиСерийныхНомеров(ДубльСН)
	
	Для Сч = 0 По Агрегаты.Количество()-1 Цикл
		Для СчВлож = Сч+1 По Агрегаты.Количество()-1 Цикл
			Если Агрегаты[Сч].СерийныйНомер = Агрегаты[СчВлож].СерийныйНомер Тогда
				ДубльСН = Агрегаты[Сч].СерийныйНомер;
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокАгрегатовПоСерийнымНомерам()
	
	МассивРезультат = Новый Массив;
	ТЗ = уатОбщегоназначения.ПолучитьСписокАгрегатовПоСерийнымНомерам(
		Агрегаты.Выгрузить().ВыгрузитьКолонку("СерийныйНомер"));
	Для Каждого ТекЭлемент Из ТЗ Цикл 
		СтрокаРезультат = Новый Структура;
		СтрокаРезультат.Вставить("Наименование",  ТекЭлемент.Значение.Наименование);
		СтрокаРезультат.Вставить("СерийныйНомер", ТекЭлемент.Значение.СерийныйНомер);
		МассивРезультат.Добавить(СтрокаРезультат);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

#КонецОбласти
